In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('../datasets/cgpa/cgpa.csv')

In [3]:
df.head()

   rollno      cgpa  rank
0       1  5.215008  9000
1       2  6.161833  9001
2       3  8.301801  9002
3       4  6.889414  9003
4       5  8.393946  9004

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500000 entries, 0 to 499999
Data columns (total 3 columns):
rollno    500000 non-null int64
cgpa      500000 non-null float64
rank      500000 non-null int64
dtypes: float64(1), int64(2)
memory usage: 11.4 MB

In [16]:
#writing function to change cgpa into grade
def cgpa_to_grade(item):
    cgpa=item.loc['cgpa']
    if cgpa>8:
        return 'A'
    else:
        return 'B'

In [26]:
%%time
df['grade']=df.apply(cgpa_to_grade,axis=1)
df['grade'].value_counts()

Wall time: 18.6 s

In [29]:
def cgpa_to_grade_2(item):
    if item >= 8 and item <10:
        return 'A'
    elif item>=6 and item<8:
        return 'B'
    elif item>=4 and item<6:
        return 'B'
    else:
        return 'D'

In [30]:
%%time
df['grade2']=df['cgpa'].apply(cgpa_to_grade_2)
df['grade2'].value_counts()

Wall time: 345 ms

In [33]:
df.tail(20)

        rollno      cgpa    rank grade grade2
499980  499981  9.019354  508980     A      A
499981  499982  7.199021  508981     B      B
499982  499983  5.314654  508982     B      B
499983  499984  8.823959  508983     A      A
499984  499985  9.570014  508984     A      A
499985  499986  7.610885  508985     B      B
499986  499987  6.466133  508986     B      B
499987  499988  5.588674  508987     B      B
499988  499989  8.681556  508988     A      A
499989  499990  8.504246  508989     A      A
499990  499991  8.841961  508990     A      A
499991  499992  6.136499  508991     B      B
499992  499993  7.096307  508992     B      B
499993  499994  7.769875  508993     B      B
499994  499995  5.747173  508994     B      B
499995  499996  9.387890  508995     A      A
499996  499997  9.094913  508996     A      A
499997  499998  8.430407  508997     A      A
499998  499999  7.329542  508998     B      B
499999  500000  9.358222  508999     A      A

In [34]:
df_2=pd.read_csv('../datasets/Blood Donation/training.csv')

In [35]:
df_2.head()

,Unnamed: 0,Months since Last Donation,Number of Donations,Total Volume Donated (c.c.),Months since First Donation,Made Donation in March 2007
0,619,2,50,12500,98,1
1,664,0,13,3250,28,1
2,441,1,16,4000,35,1
3,160,2,20,5000,45,1
4,358,1,24,6000,77,0

In [36]:
df_2.rename(columns={'Unnamed: 0':'id'}, inplace=True)

In [37]:
df_2.head()

,id,Months since Last Donation,Number of Donations,Total Volume Donated (c.c.),Months since First Donation,Made Donation in March 2007
0,619,2,50,12500,98,1
1,664,0,13,3250,28,1
2,441,1,16,4000,35,1
3,160,2,20,5000,45,1
4,358,1,24,6000,77,0

In [38]:
def id_contains(item):
    x= str(item)
    if '6' in x:
        a='contains 6'
    else:
        a = 'no 6'
    return a

In [40]:
df_2['out']=df_2['id'].apply(id_contains)

In [41]:
df_2.head()

,id,Months since Last Donation,Number of Donations,Total Volume Donated (c.c.),Months since First Donation,Made Donation in March 2007,out
0,619,2,50,12500,98,1,contains 6
1,664,0,13,3250,28,1,contains 6
2,441,1,16,4000,35,1,no 6
3,160,2,20,5000,45,1,contains 6
4,358,1,24,6000,77,0,no 6

In [44]:
def out_contains(item):
    if 'con' in item or 'tain' in item:
        a='got you'
    else:
        a = 'got you too'
    return a

In [45]:
df_2['out2']=df_2['out'].apply(out_contains)

In [46]:
df_2.head()

,id,Months since Last Donation,Number of Donations,Total Volume Donated (c.c.),Months since First Donation,Made Donation in March 2007,out,out2
0,619,2,50,12500,98,1,contains 6,got you
1,664,0,13,3250,28,1,contains 6,got you
2,441,1,16,4000,35,1,no 6,got you too
3,160,2,20,5000,45,1,contains 6,got you
4,358,1,24,6000,77,0,no 6,got you too